# StructuralSection Methods

---
The StructuralSection type exposes the following members.
| Name| Description
---|---|---
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetBoundarySize|  Returns size of the section boundary.
| GetEnumerator|
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace